Revit 2026 API

# FileExportedEventArgs Class

---

The event arguments used by the FileExported event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPostEventArgs Autodesk.Revit.DB.EventsRevitAPIPostDocEventArgs Autodesk.Revit.DB.EventsFileExportedEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FileExportedEventArgs : RevitAPIPostDocEventArgs
```
```vb
Public Class FileExportedEventArgs
	Inherits RevitAPIPostDocEventArgs
```
```cpp
public ref class FileExportedEventArgs : public RevitAPIPostDocEventArgs
```
```fsharp
type FileExportedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
```

The FileExportedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BackgroundOperation | Identifies whether the event belongs to a background export operation. |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPostDocEventArgs) |
|  | Format | Identifies the export format, e.g. DWG or image. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Path | Target path for the exported file (or files). |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). (Inherited from RevitAPIPostEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace